# 2. 파이썬으로 데이터 주무르기, pandas
**pandas를 활용해서 데이터프레임을 다뤄봅시다.**

1. Pandas 시작하기
    - prerequisite : Table
    - pandas import하기
   
2. Pandas로 1차원 데이터 다루기 - Series 
    - Series 선언하기
    - Series vs ndarray
    - Series vs dict
    - Series에 이름 붙이기
3. Pandas로 2차원 데이터 다루기 - dataframe
    - dataframe 선언하기
    - from csv to dataframe
    - dataframe 자료 접근하기

[수업에 사용된 covid 데이터](https://www.kaggle.com/imdevskp/corona-virus-report)

## I. pandas 시작하기

### Table
- 행과 열을 이용해 데이터를 저장, 관리하는 자료구조(컨테이너))
- 주로, 행은 개체, 열은 속성을 나타냄

In [2]:
import pandas as pd

## II. pandas로 1차원 데이터 다루기 - Series

### Series 
- 1-D labeled **array**
- 인덱스를 지정할 수 있음.

In [3]:
s = pd.Series([1,4,9,16,25])
s

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [4]:
t= pd.Series({'one':1, 'two':2, 'three':3, 'four':4})
t

one      1
two      2
three    3
four     4
dtype: int64

In [5]:
t[t>t.median()]

three    3
four     4
dtype: int64

In [6]:
s[[3,1,2]] # 여러 index호출

3    16
1     4
2     9
dtype: int64

In [7]:
import numpy as np

e = np.exp(s)
e

0    2.718282e+00
1    5.459815e+01
2    8.103084e+03
3    8.886111e+06
4    7.200490e+10
dtype: float64

In [8]:
e.dtype

dtype('float64')

### Series + dict

In [9]:
'one' in t

True

In [10]:
t['seven']=t.get('seven',7)

In [11]:
t['seven']

7

### series 이름 붙이기
- name 속성을 가지고 있다.

In [12]:
s = pd.Series(np.random.normal(loc=1, scale=0.3,size=(10,)), name = 'Normalizatoin')
s

0    0.846190
1    1.438075
2    0.933886
3    0.883028
4    0.982899
5    0.898129
6    0.871800
7    0.640903
8    0.592592
9    0.640693
Name: Normalizatoin, dtype: float64

## III. Pandas로 2차원 데이터 다루기 - dataframe

- 2-D labeled **table**
- 인덱스 지정 가능
- 시리즈의 병렬적인 모음

In [13]:
d = {"height":[1,2,3,4],"weight":[30,40,50,60]}
df = pd.DataFrame(d)
df

   height  weight
0       1      30
1       2      40
2       3      50
3       4      60

In [14]:
# dtype 확인
df.dtypes

height    int64
weight    int64
dtype: object

### From CSV to dataframe

- Comma Saperated Value -> DataFrame
- `.read_csv()`

In [15]:
ex1= pd.read_csv('../3w/archive/country_wise_latest.csv')
ex1.head(5)

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa

In [16]:
ex1.tail(5)

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
182,West Bank and Gaza,10621,78,3752,6791,152,2,0,0.73,35.33,2.08,8916,1705,19.12,Eastern Mediterranean
183,Western Sahara,10,1,8,1,0,0,0,10.00,80.00,12.50,10,0,0.00,Africa
184,Yemen,1691,483,833,375,10,4,36,28.56,49.26,57.98,1619,72,4.45,Eastern Mediterranean
185,Zambia,4552,140,2815,1597,71,1,465,3.08,61.84,4.97,3326,1226,36.86,Africa
186,Zimbabwe,2704,36,542,2126,192,2,24,1.33,20.04,6.64,1713,991,57.85,Africa

In [17]:
ex1.describe()

/Users/jykim/opt/anaconda3/envs/DevCourse_6/lib/python3.10/site-packages/pandas/core/nanops.py:1010: RuntimeWarning: invalid value encountered in subtract
  sqr = _ensure_numeric((avg - values) ** 2)

,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase
count,1.870000e+02,187.000000,1.870000e+02,1.870000e+02,187.000000,187.000000,187.000000,187.000000,187.000000,187.00,1.870000e+02,187.000000,187.000000
mean,8.813094e+04,3497.518717,5.063148e+04,3.400194e+04,1222.957219,28.957219,933.812834,3.019519,64.820535,inf,7.868248e+04,9448.459893,13.606203
std,3.833187e+05,14100.002482,1.901882e+05,2.133262e+05,5710.374790,120.037173,4197.719635,3.454302,26.287694,NaN,3.382737e+05,47491.127684,24.509838
min,1.000000e+01,0.000000,0.000000e+00,0.000000e+00,0.000000,0.000000,0.000000,0.000000,0.000000,0.00,1.000000e+01,-47.000000,-3.840000
25%,1.114000e+03,18.500000,6.265000e+02,1.415000e+02,4.000000,0.000000,0.000000,0.945000,48.770000,1.45,1.051500e+03,49.000000,2.775000
50%,5.059000e+03,108.000000,2.815000e+03,1.600000e+03,49.000000,1.000000,22.000000,2.150000,71.320000,3.62,5.020000e+03,432.000000,6.890000
75%,4.046050e+04,734.000000,2.260600e+04,9.149000e+03,419.500000,6.000000,221.000000,3.875000,86.885000,6.44,3.708050e+04,3172.000000,16.855000
max,4.290259e+06,148011.000000,1.846641e+06,2.816444e+06,56336.000000,1076.000000,33728.000000,28.560000,100.000000,inf,3.834677e+06,455582.000000,226.320000

### data 접근하기

In [18]:
ex1['Deaths / 100 Cases']

0       3.50
1       2.95
2       4.16
3       5.73
4       4.32
       ...
182     0.73
183    10.00
184    28.56
185     3.08
186     1.33
Name: Deaths / 100 Cases, Length: 187, dtype: float64

In [19]:
# 신규 확진자 100명이 넘는 나라 찾기

ex1[ex1['New cases']>=100]['Country/Region']

0             Afghanistan
1                 Albania
2                 Algeria
6               Argentina
8               Australia
              ...
177        United Kingdom
179            Uzbekistan
180             Venezuela
182    West Bank and Gaza
186              Zimbabwe
Name: Country/Region, Length: 82, dtype: object

### 행기준 데이터 접근

- 인덱스 이름 이용 : `.loc[row,col]`

In [20]:
books = pd.read_csv('../3w/archive/covid_19_clean_complete.csv')

books.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered,Active,WHO Region
0,NaN,Afghanistan,33.93911,67.709953,2020-01-22,0,0,0,0,Eastern Mediterranean
1,NaN,Albania,41.15330,20.168300,2020-01-22,0,0,0,0,Europe
2,NaN,Algeria,28.03390,1.659600,2020-01-22,0,0,0,0,Africa
3,NaN,Andorra,42.50630,1.521800,2020-01-22,0,0,0,0,Europe
4,NaN,Angola,-11.20270,17.873900,2020-01-22,0,0,0,0,Africa

In [21]:
books.loc[9064,'Lat'] # 이때는 index name이 번호라 번호를 활용한것,
# 이름이 있다면 row자리에 index name을 적으면 됨.

23.885942

- 인덱스 번호 이용 `.iloc[row_idx, col_idx]`

In [22]:
books.iloc[9064,2]

23.885942

### groupby

- split  : 특정 '기준'을 바탕으로 dataFrame 분할
- Apply : 통계 함수 - `sum()`, `mean()`, `median()`을 적용하여 각 데이터 압축
- Combine : Apply된 결과를 바탕으로 새로운 Series 생성

## Mission:
### 1. covid 데이터에서 100 case 대비 사망률(`Deaths / 100 Cases`)이 가장 높은 국가는?

In [23]:
df = pd.read_csv('../3w/archive/country_wise_latest.csv')
df[df['Deaths / 100 Cases']== df['Deaths / 100 Cases'].max()]['Country/Region']

184    Yemen
Name: Country/Region, dtype: object

### 2. covid 데이터에서 신규 확진자가 없는 나라 중 WHO Region이 'Europe'를 모두 출력하면?  
Hint : 한 줄에 동시에 두가지 조건을 Apply하는 경우 Warning이 발생할 수 있습니다.

In [24]:
no_case= df[df['New cases']==0]
no_case[no_case['WHO Region']=='Europe']['Country/Region']

56           Estonia
75          Holy See
95            Latvia
100    Liechtenstein
113           Monaco
143       San Marino
157            Spain
Name: Country/Region, dtype: object

### 3. 다음 [데이터](https://www.kaggle.com/neuromusic/avocado-prices)를 이용해 각 Region별로 아보카도가 가장 비싼 평균가격(AveragePrice)을 출력하면?

In [26]:
# 1. 'AveragePrice'열 중에서
# 2. 'region' 별 max치를 뽑아옴.
avo = pd.read_csv('../3w/archive/avocado.csv')
g = avo[['AveragePrice']].groupby(avo['region']).max()
g.head()

                     AveragePrice
region
Albany                       2.13
Atlanta                      2.75
BaltimoreWashington          2.28
Boise                        2.79
Boston                       2.19

In [27]:
avo

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico